alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/atdf/ATSAML21J17BU.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!--
Copyright (c) 2017 Microchip Technology Inc.

SPDX-License-Identifier: Apache-2.0

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2017-11-11T13:36:03Z"/>
  <variants>
    <variant ordercode="SAML21J17B-UU" package="WLCSP64" pinout="SAML21JU" speedmax="48000000" tempmin="-40" tempmax="85" vccmin="1.62" vccmax="3.63"/>
  </variants>
  <devices>
    <device name="ATSAML21J17BU" architecture="CORTEX-M0PLUS" family="SAML" series="SAML21">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="FLASH" start="0x00000000" size="0x20000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="CAL" start="0x00800000" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="LOCKBIT" start="0x00802000" size="0x4" type="fuses" rw="R"/>
          
          
          
          
          
          
          <memory-segment name="AUX0" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW"/><memory-segment name="AUX1" start="0x00806000" size="0x100" type="fuses" pagesize="64" rw="R"/>
          <memory-segment name="RWW" start="0x00400000" size="0x1000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="HSRAM" start="0x20000000" size="0x4000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="LPRAM" start="0x30000000" size="0x2000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW"/>
          <memory-segment name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW"/>
          <memory-segment name="HPB3" start="0x43000000" size="0x2000" type="io" rw="RW"/>
          <memory-segment name="HPB4" start="0x44000000" size="0x1000" type="io" rw="RW"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
          <memory-segment name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW"/>
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00000000" size="0x10000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="NUM_IRQ" value="29"/>
        <param name="__CM0PLUS_REV" value="0x0001"/>
        <param name="__MPU_PRESENT" value="0"/>
        <param name="__NVIC_PRIO_BITS" value="2"/>
        <param name="__VTOR_PRESENT" value="1"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
        <param name="__DEVICE_IS_SAM" value="1"/>
      </parameters>
      <peripherals>
        <module name="AC" id="U2245" version="1.0.1">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x43001000"/>
            <signals>
              <signal group="AIN" index="0" function="B_AC" pad="PA04"/>
              <signal group="AIN" index="1" function="B_AC" pad="PA05"/>
              <signal group="AIN" index="2" function="B_AC" pad="PA06"/>
              <signal group="AIN" index="3" function="B_AC" pad="PA07"/>
              <signal group="CMP" index="0" function="H" pad="PA12"/>
              <signal group="CMP" index="0" function="H" pad="PA18"/>
              <signal group="CMP" index="1" function="H" pad="PA13"/>
              <signal group="CMP" index="1" function="H" pad="PA19"/>
            </signals>
            <parameters>
              <param name="COMPCTRL_MUXNEG_OPAMP" value="7"/>
              <param name="GCLK_ID" value="31"/>
              <param name="NUM_CMP" value="2"/>
              <param name="PAIRS" value="1"/>
              <param name="INSTANCE_ID" value="100"/>
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="U2247" version="1.1.1">
          <instance name="ADC">
            <register-group name="ADC" name-in-module="ADC" address-space="base" offset="0x43000C00"/>
            <signals>
              <signal group="AIN" index="0" function="B_ADC" pad="PA02"/>
              <signal group="AIN" index="1" function="B_ADC" pad="PA03"/>
              <signal group="AIN" index="2" function="B_ADC" pad="PB08"/>
              <signal group="AIN" index="3" function="B_ADC" pad="PB09"/>
              <signal group="AIN" index="4" function="B_ADC" pad="PA04"/>
              <signal group="AIN" index="5" function="B_ADC" pad="PA05"/>
              <signal group="AIN" index="6" function="B_ADC" pad="PA06"/>
              <signal group="AIN" index="7" function="B_ADC" pad="PA07"/>
              <signal group="AIN" index="8" function="B_ADC" pad="PB00"/>
              <signal group="AIN" index="9" function="B_ADC" pad="PB01"/>
              <signal group="AIN" index="10" function="B_ADC" pad="PB02"/>
              <signal group="AIN" index="11" function="B_ADC" pad="PB03"/>
              <signal group="AIN" index="12" function="B_ADC" pad="PB04"/>
              <signal group="AIN" index="13" function="B_ADC" pad="PB05"/>
              <signal group="AIN" index="14" function="B_ADC" pad="PB06"/>
              <signal group="AIN" index="15" function="B_ADC" pad="PB07"/>
              <signal group="AIN" index="16" function="B_ADC" pad="PA08"/>
              <signal group="AIN" index="17" function="B_ADC" pad="PA09"/>
              <signal group="AIN" index="18" function="B_ADC" pad="PA10"/>
              <signal group="AIN" index="19" function="B_ADC" pad="PA11"/>
              <signal group="VREFP" function="B_ANAREF" pad="PA04"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="37"/>
              <param name="EXTCHANNEL_MSB" value="19"/>
              <param name="GCLK_ID" value="30"/>
              <param name="RESULT_BITS" value="16"/>
              <param name="RESULT_MSB" value="15"/>
              <param name="INSTANCE_ID" value="99"/>
            </parameters>
          </instance>
        </module>
        <module name="AES" id="U2238" version="2.0.0">
          <instance name="AES">
            <register-group name="AES" name-in-module="AES" address-space="base" offset="0x42003400"/>
            <parameters>
              <param name="DMAC_ID_RD" value="45"/>
              <param name="DMAC_ID_WR" value="44"/>
              <param name="INSTANCE_ID" value="77"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="U2225" version="1.0.1">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x43001C00"/>
            <signals>
              <signal group="IN" index="0" function="I" pad="PA04"/>
              <signal group="IN" index="0" function="I" pad="PA16"/>
              <signal group="IN" index="0" function="I" pad="PB22"/>
              <signal group="IN" index="1" function="I" pad="PA05"/>
              <signal group="IN" index="1" function="I" pad="PA17"/>
              <signal group="IN" index="1" function="I" pad="PB00"/>
              <signal group="IN" index="2" function="I" pad="PA06"/>
              <signal group="IN" index="2" function="I" pad="PA18"/>
              <signal group="IN" index="2" function="I" pad="PB01"/>
              <signal group="IN" index="3" function="I" pad="PA08"/>
              <signal group="IN" index="3" function="I" pad="PA30"/>
              <signal group="IN" index="4" function="I" pad="PA09"/>
              <signal group="IN" index="5" function="I" pad="PA10"/>
              <signal group="IN" index="5" function="I" pad="PB10"/>
              <signal group="IN" index="6" function="I" pad="PA22"/>
              <signal group="IN" index="6" function="I" pad="PB06"/>
              <signal group="IN" index="7" function="I" pad="PA23"/>
              <signal group="IN" index="7" function="I" pad="PB07"/>
              <signal group="IN" index="8" function="I" pad="PA24"/>
              <signal group="IN" index="8" function="I" pad="PB08"/>
              <signal group="IN" index="9" function="I" pad="PB14"/>
              <signal group="IN" index="10" function="I" pad="PB15"/>
              <signal group="IN" index="11" function="I" pad="PB16"/>
              <signal group="OUT" index="0" function="I" pad="PA07"/>
              <signal group="OUT" index="0" function="I" pad="PA19"/>
              <signal group="OUT" index="0" function="I" pad="PB02"/>
              <signal group="OUT" index="0" function="I" pad="PB23"/>
              <signal group="OUT" index="1" function="I" pad="PA11"/>
              <signal group="OUT" index="1" function="I" pad="PA31"/>
              <signal group="OUT" index="1" function="I" pad="PB11"/>
              <signal group="OUT" index="2" function="I" pad="PA25"/>
              <signal group="OUT" index="2" function="I" pad="PB09"/>
              <signal group="OUT" index="3" function="I" pad="PB17"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="34"/>
              <param name="IO_NUM" value="12"/>
              <param name="LUT_NUM" value="4"/>
              <param name="SEQ_NUM" value="2"/>
              <param name="INSTANCE_ID" value="103"/>
            </parameters>
          </instance>
        </module>
        <module name="DAC" id="U2244" version="1.1.2">
          <instance name="DAC">
            <register-group name="DAC" name-in-module="DAC" address-space="base" offset="0x42003000"/>
            <signals>
              <signal group="VOUT" index="0" function="B_DAC" pad="PA02"/>
              <signal group="VOUT" index="1" function="B_DAC" pad="PA05"/>
              <signal group="VREFP" function="B_ANAREF" pad="PA03"/>
            </signals>
            <parameters>
              <param name="DAC_NUM" value="2"/>
              <param name="DATA_SIZE" value="12"/>
              <param name="GCLK_ID" value="32"/>
              <param name="INSTANCE_ID" value="76"/>
            </parameters>
          </instance>
        </module>
