alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/atdf/ATSAML21J17BU.atdf
        <register name="SHPR3" offset="0xD20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Priority Register 3">
          <bitfield name="PRI_14" caption="Priority of system handler 14, PendSV" mask="0xFF0000"/>
          <bitfield name="PRI_15" caption="Priority of system handler 15, SysTick exception" mask="0xFF000000"/>
        </register>
        <register name="SHCSR" offset="0xD24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Control and State Register">
          <bitfield name="SVCALLPENDED" caption="no description available" mask="0x8000"/>
        </register>
        <register name="DFSR" offset="0xD30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Debug Fault Status Register">
          <bitfield name="HALTED" caption="Halt request debug event active" mask="0x1"/>
          <bitfield name="BKPT" caption="Breakpoint debug event" mask="0x2"/>
          <bitfield name="DWTTRAP" caption="DWT debug event" mask="0x4"/>
          <bitfield name="VCATCH" caption="Vector catch debug event" mask="0x8"/>
          <bitfield name="EXTERNAL" caption="EDBGRQ debug event" mask="0x10"/>
        </register>
      </register-group>
      <value-group name="SystemControl_ICSR__NMIPENDSET">
        <value name="VALUE_0" caption="Write: no effect; read: NMI exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes NMI exception state to pending; read: NMI exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the SysTick exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTSET">
        <value name="VALUE_0" caption="Write: no effect; read: SysTick exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the PendSV exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVSET">
        <value name="VALUE_0" caption="Write: no effect; read: PendSV exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__ENDIANNESS">
        <value name="VALUE_0" caption="Little-endian" value="0"/>
        <value name="VALUE_1" caption="Big-endian" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__SYSRESETREQ">
        <value name="VALUE_0" caption="No system reset request" value="0"/>
        <value name="VALUE_1" caption="Asserts a signal to the outer system that requests a reset" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SEVONPEND">
        <value name="VALUE_0" caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" value="0"/>
        <value name="VALUE_1" caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__STKALIGN">
        <value name="VALUE_0" caption="4-byte aligned" value="0"/>
        <value name="VALUE_1" caption="8-byte aligned" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAML21JU" caption="SAML21JU">
      <pin position="A1" pad="PB03"/>
      <pin position="A3" pad="PA03"/>
      <pin position="A5" pad="VDDANA"/>
      <pin position="A7" pad="PB08"/>
      <pin position="B2" pad="PA01"/>
      <pin position="B4" pad="GNDANA"/>
      <pin position="B6" pad="PB07"/>
      <pin position="B8" pad="PA05"/>
      <pin position="C1" pad="PB01"/>
      <pin position="C3" pad="PA02"/>
      <pin position="C5" pad="PB06"/>
      <pin position="C7" pad="PA04"/>
      <pin position="D2" pad="PA00"/>
      <pin position="D4" pad="PA06"/>
      <pin position="D6" pad="PB09"/>
      <pin position="D8" pad="PA08"/>
      <pin position="E1" pad="PB31"/>
      <pin position="E3" pad="PB04"/>
      <pin position="E5" pad="PA07"/>
      <pin position="E7" pad="PA09"/>
      <pin position="F2" pad="PB30"/>
      <pin position="F4" pad="PB05"/>
      <pin position="F6" pad="PA10"/>
      <pin position="F8" pad="PA11"/>
      <pin position="G1" pad="PA30"/>
      <pin position="G3" pad="PB00"/>
      <pin position="G5" pad="PB11"/>
      <pin position="G7" pad="GNDIO"/>
      <pin position="H2" pad="VDDIN"/>
      <pin position="H4" pad="PB02"/>
      <pin position="H6" pad="VDDIO"/>
      <pin position="H8" pad="PB10"/>
      <pin position="J1" pad="GNDIO"/>
      <pin position="J3" pad="PA31"/>
      <pin position="J5" pad="PB12"/>
      <pin position="J7" pad="PB14"/>
      <pin position="K2" pad="VSW"/>
      <pin position="K4" pad="PB17"/>
      <pin position="K6" pad="PB15"/>
      <pin position="K8" pad="PB13"/>
      <pin position="L1" pad="VDDCORE"/>
      <pin position="L3" pad="PB23"/>
      <pin position="L5" pad="VDDIO"/>
      <pin position="L7" pad="PA13"/>
      <pin position="M2" pad="PA27"/>
      <pin position="M4" pad="PA21"/>
      <pin position="M6" pad="GNDIO"/>
      <pin position="M8" pad="PA12"/>
      <pin position="N1" pad="RESET_N"/>
      <pin position="N3" pad="PA24"/>
      <pin position="N5" pad="PA19"/>
      <pin position="N7" pad="PA14"/>
      <pin position="P2" pad="GNDIO"/>
      <pin position="P4" pad="PA23"/>
      <pin position="P6" pad="PA18"/>
      <pin position="P8" pad="PA15"/>
      <pin position="Q1" pad="PB22"/>
      <pin position="Q3" pad="PA25"/>
      <pin position="Q5" pad="PA20"/>
      <pin position="Q7" pad="PA17"/>
      <pin position="R2" pad="VDDIO"/>
      <pin position="R4" pad="PA22"/>
      <pin position="R6" pad="PB16"/>
      <pin position="R8" pad="PA16"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>